AccumulationRegisters/ДвиженияПоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияПоНДС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейДвиженийПоНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеДвиженийПоНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НДСЗаписиКнигиПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НДСЗаписиКнигиПродаж</Name>
			<Comment>НДС. Записи книги продаж</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗаписиКнигиПродаж</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковНДСПредъявленного</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьДополнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректируемыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СторнирующаяЗаписьДопЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента (для СФ на аванс, нал.агента по 161.5)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданныйАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.СводнаяСправкаНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураКомиссионеру</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСчетаФактурыКомиссионера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЦенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмуществоСУчетомНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандировочныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентРеализацияИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентИностранцы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентКомитент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыНезавершенногоСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПосредническиеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботыИУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРПодрядные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРСобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммыСвязанныеСРасчетамиПоОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежиОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныйСоюз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданныеНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученныеНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученныхНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиНеНаТерриторииРФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗаписейДвиженийПоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЗаписейДвиженийПоНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

AccumulationRegisters/ДвиженияПоНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Собирает структуру из текстов запросов для дальнейшей проверки даты запрета.
// 
// Параметры:
// 	Запрос - Запрос - Запрос по проверке даты запрета, можно установить параметры
// Возвращаемое значение:
// 	Структура - см. ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов
Функция ТекстЗапросаКонтрольДатыЗапрета(Запрос) Экспорт
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияПоНДС.Имя;
	ИмяТаблицыИзменений = "ТаблицаИзмененийДвиженияПоНДС"; 
	СтруктураТекстовЗапросов = ПроведениеДокументов.ШаблонТекстЗапросаКонтрольДатыЗапрета(Запрос, 
		ИмяРегистра, 
		ИмяТаблицыИзменений, 
		"ФинансовыйКонтур");
	Возврат СтруктураТекстовЗапросов

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.ДвиженияПоНДС.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.8.38";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a1c356a6-e58d-4c0d-a8fe-62bc650082ee");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.ДвиженияПоНДС.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет регистр по данным документов регистраторов и регистров накопления ""НДС записи книги продаж"" и ""НДС записи книги покупок""'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.АктВыполненныхРабот.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВозвратТоваровМеждуОрганизациями.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВозвратТоваровОтКлиента.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВозвратТоваровПоставщику.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВыкупВозвратнойТарыКлиентом.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВыкупТоваровХранителем.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.КорректировкаРеализации.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ОтчетКомитенту.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ОтчетКомитентуОЗакупках.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ОтчетОРозничныхПродажах.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациями.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.РеализацияУслугПрочихАктивов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.СчетФактураВыданныйАванс.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.СчетФактураПолученныйАванс.ПолноеИмя());
	//++ Локализация
	Читаемые.Добавить(Метаданные.Документы.ЗаписьКнигиПокупок.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ЗаписьКнигиПродаж.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ЗаявлениеОВвозеТоваров.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.СчетФактураНалоговыйАгент.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.СчетФактураПолученныйНалоговыйАгент.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.НДСЗаписиКнигиПродаж.ПолноеИмя());
	//-- Локализация
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.ДвиженияПоНДС.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

КонецПроцедуры

// Описание
// 
// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры = Неопределено) Экспорт

	МетаданныеРегистра = СоздатьНаборЗаписей().Метаданные();
	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ВозвратТоваровМеждуОрганизациями КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|			ГДЕ
	|				НДСЗаписиКнигиПокупок.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПокупок.РегламентнаяОперация
	|				И НДСЗаписиКнигиПокупок.НДС <> 0)
	//-- Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ВозвратТоваровОтКлиента КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|			ГДЕ
	|				НДСЗаписиКнигиПокупок.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПокупок.РегламентнаяОперация
	|				И НДСЗаписиКнигиПокупок.НДС <> 0)
	//-- Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ВозвратТоваровПоставщику КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0
	|				
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|			ГДЕ
	|				НДСЗаписиКнигиПокупок.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПокупок.РегламентнаяОперация
	|				И НДСЗаписиКнигиПокупок.НДС <> 0)
	//-- Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|			ГДЕ
	|				НДСПредъявленный.Регистратор = Документ.Ссылка)
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.АктВыполненныхРабот КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ВыкупВозвратнойТарыКлиентом КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ВыкупТоваровХранителем КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ОтчетКомитенту КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ОтчетКомитентуОЗакупках КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ОтчетКомиссионера КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ОтчетОРозничныхПродажах КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ОтчетПоКомиссииМеждуОрганизациями КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ПередачаТоваровМеждуОрганизациями КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.РеализацияУслугПрочихАктивов КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	//++ Локализация
	|		И ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|			ГДЕ
	|				НДСЗаписиКнигиПродаж.Регистратор = Документ.Ссылка
	|				И НЕ НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|				И НДСЗаписиКнигиПродаж.НДС <> 0)
	//-- Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.СчетФактураВыданныйАванс КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.СчетФактураПолученныйАванс КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	|
	//++ Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ЗаявлениеОВвозеТоваров КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ЗаписьКнигиПродаж КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.ЗаписьКнигиПокупок КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.СчетФактураНалоговыйАгент КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	|				
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		Документ.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.СчетФактураПолученныйНалоговыйАгент КАК Документ
	|	ГДЕ
	|		Документ.Проведен
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = Документ.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		НДСЗаписиКнигиПокупок.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|	ГДЕ
	|		НДСЗаписиКнигиПокупок.РегламентнаяОперация
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = НДСЗаписиКнигиПокупок.Регистратор)
	|				
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		НДСЗаписиКнигиПродаж.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|	ГДЕ
	|		НДСЗаписиКнигиПродаж.РегламентнаяОперация
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.ДвиженияПоНДС КАК ДвиженияПоНДС
	|			ГДЕ
	|				ДвиженияПоНДС.Регистратор = НДСЗаписиКнигиПродаж.Регистратор)
	//-- Локализация
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры,
		Регистраторы,
		ПолноеИмяРегистра);
		
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеРегистра = СоздатьНаборЗаписей().Метаданные();
	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	//++ Локализация
	АвансыПолученные = Новый Массив();
	АвансыПолученные.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученных);
	АвансыПолученные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	АвансыПолученные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученныеНалоговыйАгент);
	
	ТекстЗапросаПолученияОфлайнДвижений = "ВЫБРАТЬ
	|	Источник.Период                             КАК Период,
	|	Источник.Регистратор                        КАК Регистратор,
	|	Источник.Организация                        КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейДвиженийПоНДС.Исходящий) КАК ТипЗаписи,
	|	Источник.Поставщик                          КАК Контрагент,
	|	Источник.СчетФактура                        КАК СчетФактура,
	|	Источник.СтавкаНДС                          КАК СтавкаНДСПеречисление,
	|	Источник.ВидЦенности                        КАК ВидЦенности,
	|	-Источник.СуммаБезНДС                       КАК СуммаБезНДС,
	|	-Источник.НДС                               КАК НДС,
	|	-Источник.НДСУпр                            КАК НДСУпр,
	|	Источник.РегламентнаяОперация               КАК РегламентнаяОперация,
	|	НЕОПРЕДЕЛЕНО                                КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО                                КАК НастройкаХозяйственнойОперации,
	|	НЕОПРЕДЕЛЕНО                                КАК Сторно
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК Источник
	|ГДЕ
	|	Источник.Регистратор = &Регистратор
	|	И Источник.ВидЦенности В (&АвансыПолученные)
	|	И Источник.РегламентнаяОперация
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Источник.Период                             КАК Период,
	|	Источник.Регистратор                        КАК Регистратор,
	|	Источник.Организация                        КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейДвиженийПоНДС.Входящий) КАК ТипЗаписи,
	|	Источник.Поставщик                          КАК Контрагент,
	|	Источник.СчетФактура                        КАК СчетФактура,
	|	Источник.СтавкаНДС                          КАК СтавкаНДСПеречисление,
	|	Источник.ВидЦенности                        КАК ВидЦенности,
	|	Источник.СуммаБезНДС                        КАК СуммаБезНДС,
	|	Источник.НДС                                КАК НДС,
	|	Источник.НДСУпр                             КАК НДСУпр,
	|	Источник.РегламентнаяОперация               КАК РегламентнаяОперация,
	|	НЕОПРЕДЕЛЕНО                                КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО                                КАК НастройкаХозяйственнойОперации,
	|	НЕОПРЕДЕЛЕНО                                КАК Сторно
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК Источник
	|ГДЕ
	|	Источник.Регистратор = &Регистратор
	|	И НЕ Источник.ВидЦенности В (&АвансыПолученные)
	|	И Источник.РегламентнаяОперация
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Источник.Период                             КАК Период,
	|	Источник.Регистратор                        КАК Регистратор,
	|	Источник.Организация                        КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейДвиженийПоНДС.Входящий) КАК ТипЗаписи,
	|	Источник.Покупатель                         КАК Контрагент,
	|	Источник.СчетФактура                        КАК СчетФактура,
	|	Источник.СтавкаНДС                          КАК СтавкаНДСПеречисление,
	|	Источник.ВидЦенности                        КАК ВидЦенности,
	|	-Источник.СуммаБезНДС                       КАК СуммаБезНДС,
	|	-Источник.НДС                               КАК НДС,
	|	-Источник.НДСУпр                            КАК НДСУпр,
	|	Источник.РегламентнаяОперация               КАК РегламентнаяОперация,
	|	НЕОПРЕДЕЛЕНО                                КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО                                КАК НастройкаХозяйственнойОперации,
	|	НЕОПРЕДЕЛЕНО                                КАК Сторно
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК Источник
	|ГДЕ
	|	Источник.Регистратор = &Регистратор
	|	И Источник.РегламентнаяОперация";
	
	Запрос = Новый Запрос(ТекстЗапросаПолученияОфлайнДвижений);
	Запрос.УстановитьПараметр("АвансыПолученные", АвансыПолученные);
	
	ТипыРегистраторовНДСЗаписиКнигиПродаж = Метаданные.РегистрыНакопления.НДСЗаписиКнигиПродаж.СтандартныеРеквизиты.Регистратор.Тип.Типы();
	ТипыРегистраторовНДСЗаписиКнигиПокупок = Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок.СтандартныеРеквизиты.Регистратор.Тип.Типы();
	//-- Локализация
	
	Для Каждого Выборка Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Регистратор = Выборка.Регистратор;// ДокументСсылка - 
			ДокументСОнлайнДвижениями = ДокументСОнлайнДвижениями(Регистратор);
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			
			Если ДокументСОнлайнДвижениями Тогда
				ЭлементБлокировки = Блокировка.Добавить("Документ." + Регистратор.Метаданные().Имя);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Регистратор);
			КонецЕсли;
			
			//++ Локализация
			Если ТипыРегистраторовНДСЗаписиКнигиПокупок.Найти(ТипЗнч(Регистратор)) <> Неопределено Тогда
				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НДСЗаписиКнигиПокупок.НаборЗаписей");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			КонецЕсли;
			
			Если ТипыРегистраторовНДСЗаписиКнигиПродаж.Найти(ТипЗнч(Регистратор)) <> Неопределено Тогда
				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НДСЗаписиКнигиПродаж.НаборЗаписей");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			КонецЕсли;
			//-- Локализация
			Блокировка.Заблокировать();
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			
			//++ Локализация
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
			РезультатЗапросаДвиженияПоНДСОфлайн = Запрос.Выполнить();
			//-- Локализация
			
			ДвиженияПоНДС = Неопределено;
			Если ДокументСОнлайнДвижениями Тогда
				МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Регистратор);
				ДанныеДляПроведения = МенеджерДокумента.ДанныеДокументаДляПроведения(Регистратор, МетаданныеРегистра.Имя);
				ДанныеДляПроведения.Свойство("ТаблицаДвиженияПоНДС", ДвиженияПоНДС); // ТаблицаЗначений -
			КонецЕсли;
			
			//++ Локализация
			Если Не РезультатЗапросаДвиженияПоНДСОфлайн.Пустой() Тогда
				ДвиженияПоНДСОфлайн = РезультатЗапросаДвиженияПоНДСОфлайн.Выгрузить();
				ДвиженияПоНДСОфлайн.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
				
				Для Каждого СтрокаТЗ Из ДвиженияПоНДСОфлайн Цикл
						СтрокаТЗ.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(СтрокаТЗ.СтавкаНДСПеречисление);
				КонецЦикла;

				Если ДвиженияПоНДС <> Неопределено Тогда
					ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(ДвиженияПоНДСОфлайн, ДвиженияПоНДС);
				Иначе
					ДвиженияПоНДС = ДвиженияПоНДСОфлайн.Скопировать();
				КонецЕсли;
			КонецЕсли;
			//-- Локализация
			
			Если ДвиженияПоНДС <> Неопределено Тогда
				НаборЗаписей.Загрузить(ДвиженияПоНДС);
			КонецЕсли;

			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			Шаблон = НСтр("ru = 'Не удалось записать данные в регистр %1 по регистратору ""%2"", по причине: %3'");
			ТекстСообщения = 
				СтрШаблон(Шаблон,
					ПолноеИмяРегистра,
					Регистратор,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеРегистра,
				,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
		
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

Функция ДокументСОнлайнДвижениями(Документ)
	
	ТипыДокументов = Новый Соответствие();
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ВозвратТоваровОтКлиента"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.КорректировкаРеализации"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.АктВыполненныхРабот"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ВыкупТоваровХранителем"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ОтчетКомитенту"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ОтчетКомиссионера"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ОтчетКомитентуОЗакупках"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.РеализацияТоваровУслуг"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.РеализацияУслугПрочихАктивов"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.СчетФактураВыданныйАванс"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.СчетФактураПолученныйАванс"), Истина);
	//++ Локализация
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ЗаписьКнигиПродаж"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ЗаписьКнигиПокупок"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.СчетФактураНалоговыйАгент"), Истина);
	ТипыДокументов.Вставить(Тип("ДокументСсылка.СчетФактураПолученныйНалоговыйАгент"), Истина);
	//-- Локализация
	
	Возврат ТипыДокументов.Получить(ТипЗнч(Документ)) <> Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
